ExchangePlans/_ДемоОбменВРаспределеннойИнформационнойБазе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>_ДемоОбменВРаспределеннойИнформационнойБазе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоПодразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/_ДемоОбменВРаспределеннойИнформационнойБазе/Forms/ФормаУзла/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтотУзел Тогда
		Элементы.НастройкаФильтровРегистрации.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьНаСервере();
	
	ЗаполнитьНаименованиеКомандФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбновитьДанныеОбъекта(ВыбранноеЗначение);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	
	Элементы.ОткрытьСписокВыбранныхОрганизаций.Доступность = Объект.ИспользоватьОтборПоОрганизациям;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСкладамПриИзменении(Элемент)
	
	Элементы.ОткрытьСписокВыбранныхСкладов.Доступность = Объект.ИспользоватьОтборПоСкладам;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоПодразделениямПриИзменении(Элемент)
	
	Элементы.ОткрытьСписокВыбранныхПодразделений.Доступность = Объект.ИспользоватьОтборПоПодразделениям;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокВыбранныхОрганизаций(Команда)
	
	КоллекцияФильтров = Неопределено;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяЭлементаФормыДляЗаполнения",          "Организации");
	ПараметрыФормы.Вставить("ИмяРеквизитаЭлементаФормыДляЗаполнения", "Организация");
	ПараметрыФормы.Вставить("ИмяТаблицыВыбора",                       "Справочник._ДемоОрганизации");
	ПараметрыФормы.Вставить("ЗаголовокФормыВыбора",                   НСтр("ru = 'Выберите организации для отбора:'"));
	ПараметрыФормы.Вставить("МассивВыбранныхЗначений",                СформироватьМассивВыбранныхЗначений(ПараметрыФормы));
	ПараметрыФормы.Вставить("ПараметрыВнешнегоСоединения",            Неопределено);
	ПараметрыФормы.Вставить("КоллекцияФильтров",                      КоллекцияФильтров);
	
	ОткрытьФорму("ОбщаяФорма._ДемоФормаВыбораДополнительныхУсловий",
		ПараметрыФормы,
		ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВыбранныхСкладов(Команда)
	
	ПараметрыФормы = Новый Структура("АдресТаблицы", СформироватьТаблицуСкладов());
	
	ОткрытьФорму("ПланОбмена._ДемоОбменВРаспределеннойИнформационнойБазе.Форма.ФормаВыбораСкладов",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор,,,
		Новый ОписаниеОповещения("ЗавершениеВыбораСкладов", ЭтотОбъект),
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВыбранныхПодразделений(Команда)
	
	КоллекцияФильтров = Неопределено;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяЭлементаФормыДляЗаполнения",          "Подразделения");
	ПараметрыФормы.Вставить("ИмяРеквизитаЭлементаФормыДляЗаполнения", "Подразделение");
	ПараметрыФормы.Вставить("ИмяТаблицыВыбора",                       "Справочник._ДемоПодразделения");
	ПараметрыФормы.Вставить("ЗаголовокФормыВыбора",                   НСтр("ru = 'Выберите подразделения для отбора:'"));
	ПараметрыФормы.Вставить("МассивВыбранныхЗначений",                СформироватьМассивВыбранныхЗначений(ПараметрыФормы));
	ПараметрыФормы.Вставить("ПараметрыВнешнегоСоединения",            Неопределено);
	ПараметрыФормы.Вставить("КоллекцияФильтров",                      КоллекцияФильтров);
	
	ОткрытьФорму("ОбщаяФорма._ДемоФормаВыбораДополнительныхУсловий",
		ПараметрыФормы,
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Элементы.ОткрытьСписокВыбранныхОрганизаций.Доступность   = Объект.ИспользоватьОтборПоОрганизациям;
	Элементы.ОткрытьСписокВыбранныхСкладов.Доступность       = Объект.ИспользоватьОтборПоСкладам;
	Элементы.ОткрытьСписокВыбранныхПодразделений.Доступность = Объект.ИспользоватьОтборПоПодразделениям;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбъекта(Знач СтруктураПараметров)
	
	Объект[СтруктураПараметров.ИмяТаблицыДляЗаполнения].Очистить();
	
	СписокВыбранныхЗначений = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресТаблицыВоВременномХранилище);
	
	Если СписокВыбранныхЗначений.Количество() > 0 Тогда
		КолонкаПредставление = СписокВыбранныхЗначений.Колонки.Представление;
		КолонкаПредставление.Имя = СтруктураПараметров.ИмяКолонкиДляЗаполнения;
		Объект[СтруктураПараметров.ИмяТаблицыДляЗаполнения].Загрузить(СписокВыбранныхЗначений);
	КонецЕсли;
	
	ОбновитьНаименованиеКомандФормы(СтруктураПараметров.ИмяТаблицыДляЗаполнения, СтруктураПараметров.ИмяКолонкиДляЗаполнения);
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивВыбранныхЗначений(Знач ПараметрыФормы)
	
	ТабличнаяЧасть           = Объект[ПараметрыФормы.ИмяЭлементаФормыДляЗаполнения];
	ТаблицаВыбранныхЗначений = ТабличнаяЧасть.Выгрузить(,ПараметрыФормы.ИмяРеквизитаЭлементаФормыДляЗаполнения);
	МассивВыбранныхЗначений  = ТаблицаВыбранныхЗначений.ВыгрузитьКолонку(ПараметрыФормы.ИмяРеквизитаЭлементаФормыДляЗаполнения);
	
	Возврат МассивВыбранныхЗначений;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаименованиеКомандФормы()
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить(Новый Структура("ИмяТаблицы, ИмяКолонки", "Организации",   "Организация"));
	СписокТаблиц.Добавить(Новый Структура("ИмяТаблицы, ИмяКолонки", "Склады",        "СкладОтправитель"));
	СписокТаблиц.Добавить(Новый Структура("ИмяТаблицы, ИмяКолонки", "Подразделения", "Подразделение"));
	
	Для Каждого Таблица Из СписокТаблиц Цикл
		ОбновитьНаименованиеКомандФормы(Таблица.ИмяТаблицы, Таблица. ИмяКолонки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеКомандФормы(Знач ИмяТабличнойЧасти, Знач ИмяКолонкиТабличнойЧасти)
	
	СвойстваКомандыФормы = СвойстваКомандыФормы(ИмяТабличнойЧасти);
	
	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		
		Если ИмяТабличнойЧасти = "Склады" Тогда
			НовыйЗаголовокОрганизаций = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Склад отправитель: %1'"),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект[ИмяТабличнойЧасти][0][ИмяКолонкиТабличнойЧасти], "Наименование"));
			
			НовыйЗаголовокОрганизаций = НовыйЗаголовокОрганизаций + " " + НСтр("ru = '(и еще ...)'");
		Иначе
			НовыйЗаголовокОрганизаций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект[ИмяТабличнойЧасти][0][ИмяКолонкиТабличнойЧасти], "Наименование");
			
			Если Объект[ИмяТабличнойЧасти].Количество() > 1 Тогда
				НовыйЗаголовокОрганизаций = НовыйЗаголовокОрганизаций + " "
					+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '(и еще %1)'"),
						Строка(Объект[ИмяТабличнойЧасти].Количество() - 1));
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		НовыйЗаголовокОрганизаций = СвойстваКомандыФормы.ИсходныйЗаголовок;
		
	КонецЕсли;
	
	Элементы[СвойстваКомандыФормы.ИмяКоманды].Заголовок = НовыйЗаголовокОрганизаций;
	
КонецПроцедуры

&НаСервере
Функция СвойстваКомандыФормы(ИмяТабличнойЧасти)
	
	Результат = Новый Структура;
	
	Если ИмяТабличнойЧасти = "Организации" Тогда
		Результат.Вставить("ИмяКоманды", "ОткрытьСписокВыбранныхОрганизаций");
		Результат.Вставить("ИсходныйЗаголовок", НСтр("ru = 'Выбрать организации'"));
	ИначеЕсли ИмяТабличнойЧасти = "Склады" Тогда
		Результат.Вставить("ИмяКоманды", "ОткрытьСписокВыбранныхСкладов");
		Результат.Вставить("ИсходныйЗаголовок", НСтр("ru = 'Выбрать склады'"));
	Иначе
		Результат.Вставить("ИмяКоманды", "ОткрытьСписокВыбранныхПодразделений");
		Результат.Вставить("ИсходныйЗаголовок", НСтр("ru = 'Выбрать подразделения'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуСкладов()
	
	ТаблицаВыбранныхЗначений = Объект.Склады.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВыбранныхЗначений, УникальныйИдентификатор);
		
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыбораСкладов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ЗагрузитьТаблицуСкладов(Результат.АдресТаблицы);
		ОбновитьНаименованиеКомандФормы("Склады", "СкладОтправитель");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуСкладов(Знач АдресТаблицы)
	
	Объект.Склады.Загрузить(ПолучитьИзВременногоХранилища(АдресТаблицы));
	
КонецПроцедуры

#КонецОбласти
